{
  "events": [
    {
      "eventName": "Opening Ceremony",
      "speakers": [],
      "startTime": "2020-09-18T19:00",
      "endTime": "2020-09-18T20:00",
      "eventDescription": "Come learn about all that is going on this weekend at the opening ceremony! We'll then be following up the opening ceremony with live Q&A.",
      "type": "Opening Ceremony",
      "location": "Twitch or Youtube",
      "joinLink": "https://www.twitch.tv/grizzhacks"
    },
    {
      "eventName": "Team Formation",
      "speakers": [],
      "startTime": "2020-09-18T20:00",
      "endTime": "2020-09-18T20:30",
      "eventDescription": "Looking for a team or extra teammates? Join us for a virtual team formation session!",
      "type": "Team Formation",
      "location": "Google Meeting",
      "joinLink": "https://meet.google.com/ukz-kcdj-iak"
    },
    {
      "eventName": "Hacking Starts",
      "speakers": [],
      "startTime": "2020-09-18T20:30",
      "endTime": "2020-09-18T20:30",
      "eventDescription": "Ready, set, build! You can start your projects now!",
      "type": "Hacking Starts"
    },
    {
      "eventName": "Introduction to GitHub",
      "speakers": [],
      "startTime": "2020-09-18T21:00",
      "endTime": "2020-09-18T22:00",
      "eventDescription": "As with any project, having the right tools for the job is a key part of being successful. In this workshop, learn about version control and GitHub, essential tools that help software developers colaborate and share code. Never used GitHub before? That's totally fine! We'll take you through the basics, from creating your account, to creating a code repository, to adding code. Already somewhat familiar with GitHub? That's fine too! We'll be teaching more advanced concepts like pull requests, conventional commits, software versioning, and more! For every hacker, this workshop is a great help in competing for the \"Best Use of DevOps Tools\" prize!",
      "type": "Workshop",
      "location": "Google Meeting",
      "joinLink": "https://meet.google.com/tgw-pkcu-fic"
    },
    {
      "eventName": "Introduction to Android Development",
      "speakers": [],
      "startTime": "2020-09-18T22:00",
      "endTime": "2020-09-18T23:00",
      "eventDescription": "Want to get started with building mobile apps? Join Adam McNeilly, a Google Developer Expert in Android Development and one of the GrizzHacks founders as he walks you through the basics of creating your first app in Android Studio!",
      "type": "Workshop",
      "location": "Google Meeting",
      "joinLink": "https://meet.google.com/cyd-ttcb-qun"
    },
    {
      "eventName": "Introduction to Web Development",
      "speakers": [],
      "startTime": "2020-09-18T23:00",
      "endTime": "2020-09-19T00:00",
      "eventDescription": "Want to get started with building websites? Get a crash course of some of the many tools that can be used for web development. Never built a website before? We'll be starting with HTML and CSS to put together your first website. Already know HTML and CSS? We'll then be talking about Bootstrap and basic JavaScript to take your website to the next level. Finally, want to try a framework? We'll be wrapping up the workshop with a quick introduction to React, one of the most popular JavaScript frameworks!",
      "type": "Workshop",
      "location": "Google Meeting",
      "joinLink": "https://meet.google.com/imd-vwmg-mfk"
    },
    {
      "eventName": "More Info Coming Soon!",
      "speakers": [],
      "startTime": "2020-09-19T00:00",
      "endTime": "2020-09-20T00:00",
      "eventDescription": "We've got a great day full of workshops, mini-events, and more planned for Saturday! Hang tight while we just finish up the last of our scheduling!",
      "type": "Coming Soon"
    },
    {
      "eventName": "Hacking Ends",
      "speakers": [],
      "startTime": "2020-09-20T08:30",
      "endTime": "2020-09-20T08:30",
      "eventDescription": "Hacking Ends and an initial Devpost submission with you project name, tagline, teammates, and prize categories is due!",
      "type": "Hacking Ends"
    },
    {
      "eventName": "Demo Video, Devpost Write Up, and Code Repo Due",
      "speakers": [],
      "startTime": "2020-09-20T10:00",
      "endTime": "2020-09-20T10:00",
      "eventDescription": "Judging starts now! Make sure your final demo video, write up, and code repo are up on Devpost!",
      "type": "Final Devpost Due"
    },
    {
      "eventName": "Top 10 Demos",
      "speakers": [],
      "startTime": "2020-09-20T13:30",
      "endTime": "2020-09-20T14:30",
      "eventDescription": "Come check out the top 10 project from GrizzHacks 5! We'll be showing off the top 10 projects, and inviting the top 10 teams and judges onto the live stream for some quick Q & A! If your team makes it to the top 10, at least one person (preferably the whole team) needs to join the stream to be eligable for our top 3 grand prizes.",
      "type": "Top 10 Demos",
      "location": "Twitch or Youtube",
      "joinLink": "https://www.twitch.tv/grizzhacks"
    },
    {
      "eventName": "Closing Ceremony",
      "speakers": [],
      "startTime": "2020-09-20T15:00",
      "endTime": "2020-09-20T16:00",
      "eventDescription": "Learn about resources to continue your hacks, and winners are announced!",
      "type": "Closing Ceremony",
      "location": "Twitch or Youtube",
      "joinLink": "https://www.twitch.tv/grizzhacks"
    }
  ]
}
